
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 3 to add, 7 to change, 2 to destroy.</code></pre>

* Create
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;app-insights-nodejs-connection-string&#34;]
* Update
  * azurerm_api_management_subscription.product[0]
  * module.apim_product[0].azurerm_api_management_product.product
  * module.automation_runbook_client_secret_rotation[&#34;apps&#34;].azurerm_automation_schedule.client_serects
  * module.automation_runbook_client_secret_rotation[&#34;apps&#34;].azurerm_automation_schedule.client_serects_trigger_once
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;app-insights-java-connection-string&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;app-insights-java-instrumentation-key&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;app-insights-nodejs-instrumentation-key&#34;]
* Replace
  * module.application_insights_java.azurerm_application_insights.this
  * module.application_insights_nodejs.azurerm_application_insights.this


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_api_management_subscription.product[0] will be updated in-place
  ~ resource "azurerm_api_management_subscription" "product" {
      ~ allow_tracing       = false -> true
        id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/subscriptions/d5a0ba59-f5ac-4e05-9650-2e5734c17e29"
        # (8 unchanged attributes hidden)
    }

  # module.apim_product[0].azurerm_api_management_product.product will be updated in-place
  ~ resource "azurerm_api_management_product" "product" {
        id                    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/products/pip-product-stg"
      ~ subscriptions_limit   = 0 -> 20
        # (7 unchanged attributes hidden)
    }

  # module.application_insights_java.azurerm_application_insights.this must be replaced
  # (moved from azurerm_application_insights.java)
-/+ resource "azurerm_application_insights" "this" {
      ~ app_id                                = "96659351-7db0-4d86-8459-e7510ec56617" -> (known after apply)
      ~ connection_string                     = (sensitive value)
      ~ daily_data_cap_in_gb                  = 100 -> 50
      ~ daily_data_cap_notifications_disabled = false -> (known after apply)
      ~ id                                    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Insights/components/pip-ss-stg-java-appinsights" -> (known after apply)
      ~ instrumentation_key                   = (sensitive value)
      ~ name                                  = "pip-ss-stg-java-appinsights" -> "pip-ss-stg-java-appinsights-stg" # forces replacement
        tags                                  = {
            "application"         = "publishing-information-service"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
        }
      + workspace_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod"
        # (10 unchanged attributes hidden)
    }

  # module.application_insights_nodejs.azurerm_application_insights.this must be replaced
  # (moved from azurerm_application_insights.nodejs)
-/+ resource "azurerm_application_insights" "this" {
      ~ app_id                                = "bec95b39-155e-4b24-991a-62ab1f7caa0e" -> (known after apply)
      ~ connection_string                     = (sensitive value)
      ~ daily_data_cap_in_gb                  = 100 -> 50
      ~ daily_data_cap_notifications_disabled = false -> (known after apply)
      ~ id                                    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Insights/components/pip-ss-stg-nodejs-appinsights" -> (known after apply)
      ~ instrumentation_key                   = (sensitive value)
      ~ name                                  = "pip-ss-stg-nodejs-appinsights" -> "pip-ss-stg-nodejs-appinsights-stg" # forces replacement
        tags                                  = {
            "application"         = "publishing-information-service"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
        }
      + workspace_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod"
        # (10 unchanged attributes hidden)
    }

  # module.automation_runbook_client_secret_rotation["apps"].azurerm_automation_schedule.client_serects will be updated in-place
  ~ resource "azurerm_automation_schedule" "client_serects" {
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Automation/automationAccounts/pip-ss-stg-aa/schedules/rotate-client-secrets-schedule"
        name                    = "rotate-client-secrets-schedule"
      ~ start_time              = "2023-12-15T01:00:00Z" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.automation_runbook_client_secret_rotation["apps"].azurerm_automation_schedule.client_serects_trigger_once will be updated in-place
  ~ resource "azurerm_automation_schedule" "client_serects_trigger_once" {
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Automation/automationAccounts/pip-ss-stg-aa/schedules/rotate-client-secrets-schedule-single-trigger"
        name                    = "rotate-client-secrets-schedule-single-trigger"
      ~ start_time              = "2023-12-14T09:24:00Z" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["app-insights-java-connection-string"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/app-insights-java-connection-string/0edecabab46243fe99bf0503fd4bb147"
        name                    = "app-insights-java-connection-string"
        tags                    = {
            "application"         = "publishing-information-service"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "App Insights"
        }
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["app-insights-java-instrumentation-key"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/app-insights-java-instrumentation-key/d5ed46485fc24862ac8060acf4e5dda0"
        name                    = "app-insights-java-instrumentation-key"
        tags                    = {
            "application"         = "publishing-information-service"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "App Insights"
        }
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["app-insights-nodejs-connection-string"] will be created
  + resource "azurerm_key_vault_secret" "secret" {
      + expiration_date         = "2024-03-01T01:00:00Z"
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-kv-stg"
      + name                    = "app-insights-nodejs-connection-string"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "publishing-information-service"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#publishing-and-information"
          + "environment"         = "staging"
          + "managedBy"           = "Future Hearings - Publishing Information Project"
          + "source"              = "App Insights"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["app-insights-nodejs-instrumentation-key"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/app-insights-nodejs-instrumentation-key/a5c761a9ef42455c9e1ce038fe0864df"
        name                    = "app-insights-nodejs-instrumentation-key"
        tags                    = {
            "application"         = "publishing-information-service"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "App Insights"
        }
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

Plan: 3 to add, 7 to change, 2 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":141,"Program":"tfcmt","SHA1":"","Vars":{}} -->